# IsValidSectionType Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableView..::..IsValidSectionType Method
TableView Class See Also
---
Identifies if the section type is valid for this view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsValidSectionType(
	SectionType sectionType
)
```

Visual Basic
---
```text
Public Function IsValidSectionType ( _
	sectionType As SectionType _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidSectionType(
	SectionType sectionType
)
```

# ### Parameters
sectionType
    Type: Autodesk.Revit.DB..::..SectionType The section type.
# ### Return Value
True if the Section Type is valid, false otherwise.
# Remarks
Some TableViews do not contain all of the possible section types. For example, standard schedules have only a Heading and Body.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
TableView Class
Autodesk.Revit.DB Namespace